In [39]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [66]:
df = pd.read_csv('train.csv')

In [67]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [68]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [69]:
df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [70]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [71]:
df = df.drop(['Name','Cabin','Ticket','PassengerId'], axis = 1)

In [72]:
df['Age'].fillna((df['Age'].mean()), inplace = True)

In [76]:
df['Embarked'].fillna((df['Embarked'].mode()[0]), inplace = True)

In [78]:
df['Sex'] = df['Sex'].apply(lambda x: 1 if x == 'male' else 0) #Male is 1, Female is 0
df['Embarked'] = df['Embarked'].map({'S' : 0, 'C': 1, 'Q': 2})

In [79]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         0
1         1       1    0  38.0      1      0  71.2833         1
2         1       3    0  26.0      0      0   7.9250         0
3         1       1    0  35.0      1      0  53.1000         0
4         0       3    1  35.0      0      0   8.0500         0

In [80]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [153]:
df_train_cleaned = df
df_test = pd.read_csv('test.csv')

In [154]:
df_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [155]:
test_pass_id = df_test['PassengerId']
df_test= df_test.drop(['Name','Cabin','Ticket','PassengerId'], axis = 1)
df_test['Age'].fillna((df_test['Age'].mean()), inplace = True)
df_test['Fare'].fillna((df_test['Fare'].mean()), inplace = True)
df_test['Sex'] = df_test['Sex'].apply(lambda x: 1 if x == 'male' else 0)
df_test['Embarked'] = df_test['Embarked'].map({'S' : 0, 'C': 1, 'Q': 2})

In [156]:
df_test.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [157]:
df_test_cleaned = df_test

In [158]:
from sklearn.model_selection import train_test_split

In [159]:
X_train = df_train_cleaned.drop('Survived',axis = 1)
y_train = df_train_cleaned['Survived']
X_test = df_test_cleaned

In [177]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaled_X_train = scaler.fit_transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [178]:
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC

In [179]:
log_reg = LogisticRegression()
log_reg.fit(scaled_X_train,y_train)

LogisticRegression()

In [180]:
y_pred = log_reg.predict(scaled_X_test)

In [181]:
acc_log = round(log_reg.score(scaled_X_train, y_train) * 100, 2)
acc_log

80.13

In [182]:
#logistic regression assumes linearity of independent variables and log odds

In [188]:
sub_df = pd.DataFrame({'PassengerId':test_pass_id, 'Survived':y_pred})

In [189]:
sub_df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [175]:
sub_df.to_csv('TitanicSubmission.csv', index=False)